def alg(m, n):
    c, i = 7, 0

    while n != 0:
        t = 0

        while n >= c:
            t += 1
            n -= c
        m[i][n] = 1
        i += 1
        n = t

    return m


def check_mtrx(mtrx):
    right_mtrx = [
        [1, 0, 0, 0, 0, 0, 0],
        [0, 1, 0, 0, 0, 0, 0],
        [0, 0, 0, 0, 1, 0, 0],
        [1, 0, 0, 0, 0, 0, 0],
        [0, 0, 0, 0, 1, 0, 0],
        [0, 0, 0, 0, 0, 1, 0],
        [0, 0, 0, 1, 0, 0, 0],
    ]

    return mtrx == right_mtrx


m = [
    [0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0],
]

# x = 823000
# while True:
#     if check_mtrx(alg(m, x)):
#         print(x)
#         break
#     print("Текущее число", x)
#     x += 1
from pprint import pprint

pprint(alg(m, 7 * 8 * 9 * 10 * 11 * 12))
# 823542
# % 7 -> первая строчка
# % 56 -> вторая строчка
# % 56 * 71 -> третья строчка
# % 7 * 8 * 9 * 10 * 11 * 12 -> пятая строчка
